tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "shaunsingh/sfmono-nerd-font-ligaturized"
brew "bash"
brew "glib"
brew "cairo"
brew "cmatrix"
brew "fzf"
brew "git"
brew "harfbuzz"
brew "jq"
brew "openjdk"
brew "maven"
brew "neovim"
brew "ripgrep"
brew "tmux"
cask "font-hack-nerd-font"
cask "ngrok"
vscode "adpyke.codesnap"
vscode "box-of-hats.bemhelper"
vscode "bradgashler.htmltagwrap"
vscode "bradlc.vscode-tailwindcss"
vscode "cantonios.project-templates"
vscode "celianriboulet.webvalidator"
vscode "dbaeumer.vscode-eslint"
vscode "diemasmichiels.emulate"
vscode "dsznajder.es7-react-js-snippets"
vscode "dzhavat.css-flexbox-cheatsheet"
vscode "eamodio.gitlens"
vscode "equinusocio.vsc-community-material-theme"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "fallenmax.mithril-emmet"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.copilot-labs"
vscode "glenn2223.live-sass"
vscode "jansav.to-es6-template-literal"
vscode "mattpocock.ts-error-translator"
vscode "meganrogge.template-string-converter"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vsliveshare.vsliveshare"
vscode "postman.postman-for-vscode"
vscode "prisma.prisma"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "rishabhdas.cssreset"
vscode "ritwickdey.liveserver"
vscode "rodrigovallades.es7-react-js-snippets"
vscode "sburg.vscode-javascript-booster"
vscode "styled-components.vscode-styled-components"
vscode "syler.sass-indented"
vscode "tabnine.tabnine-vscode"
vscode "teabyii.ayu"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "xabikos.javascriptsnippets"
