tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Console Matrix
brew "cmatrix"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# OpenType text shaping engine
brew "harfbuzz"
# Development kit for the Java programming language
brew "openjdk"
# Java-based project management
brew "maven"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Terminal multiplexer
brew "tmux"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
vscode "adpyke.codesnap"
vscode "Box-Of-Hats.bemhelper"
vscode "bradgashler.htmltagwrap"
vscode "bradlc.vscode-tailwindcss"
vscode "cantonios.project-templates"
vscode "CelianRiboulet.webvalidator"
vscode "dbaeumer.vscode-eslint"
vscode "DiemasMichiels.emulate"
vscode "dsznajder.es7-react-js-snippets"
vscode "dzhavat.css-flexbox-cheatsheet"
vscode "eamodio.gitlens"
vscode "Equinusocio.vsc-community-material-theme"
vscode "Equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "FallenMax.mithril-emmet"
vscode "formulahendry.auto-rename-tag"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.copilot-labs"
vscode "glenn2223.live-sass"
vscode "jansav.to-es6-template-literal"
vscode "mattpocock.ts-error-translator"
vscode "meganrogge.template-string-converter"
vscode "ms-python.autopep8"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vsliveshare.vsliveshare"
vscode "Postman.postman-for-vscode"
vscode "Prisma.prisma"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "RishabhDas.cssreset"
vscode "ritwickdey.LiveServer"
vscode "rodrigovallades.es7-react-js-snippets"
vscode "sburg.vscode-javascript-booster"
vscode "styled-components.vscode-styled-components"
vscode "syler.sass-indented"
vscode "TabNine.tabnine-vscode"
vscode "teabyii.ayu"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "xabikos.JavaScriptSnippets"
